
import json
D_ct_replacers = {
                'С/Т': 'Камаз ',
                'С/С': 'Камаз ',
                'В/А': 'Камаз ',
                'В/О': 'Верхее оборудование ',
                'А/К': 'Автокран ',
                'В/Б': 'Вакуумбочка ',
                'п/п': 'Полуприцеп ',
                'НТ': 'МЗКТ ',
                'НКА': 'НКА ',
                'ПКА ': 'Жидко-азотный агрегат ',
                'трал': 'Полуприцеп ',
                'УНБ': 'Камаз УНБ',
                'KW': 'KENWORTH',
                # Crutches
                '4783 УВ 86 УВ 86': '4783 УВ 86',
                '86 УМ 8475': '8475 УМ 86',
                
                # Deletion markup
                'У/Н' : 'del У/Н',
                'куст' : 'del куст',
                '-к ' : 'del к',
                'б/н' : 'del б/н',
            }        
json.dump(D_ct_replacers, open( "D_ct_replacers.json", 'w' ))
D_ct_patterns = {
                '(гос.№)|(гос№)|(Гос№)|(№)': ' ',
                'Маш-т': ' ', 
                '\n': ' ', 
                '/': ' ', 
                '\.': ' ', 
                'нет вод': ' ', 
                'ПС': ' ', 
                '(25м3)': ' ', 
                
                '-': ' ', 
                '\)': ' ', 
                '50м3': ' ', 
                '46м3': ' ', 
                '45м3': ' ', 
                'ГТ': ' ', 
                '\БР\s*\d+': ' ', 
                '\(\s+\)': ' ',
                
                'в ГНКТ 8': ' ', 
                '\s\в': ' ', 
                '\s\в 8': ' ', 
                '\s*\эл': ' ', 
                '\s*\на ЮР 5': ' ', 
                'МК30Т': ' '
            }

json.dump(D_ct_patterns, open( "D_ct_patterns.json", 'w' ))
D_ct_trucks = {
        '072': '072нива',
        '445': '445енс'
}
json.dump(D_ct_trucks, open( "D_ct_trucks.json", 'w' ))
